kex2017/ad7606/stm32_src/RIOT/cpu/stm32f1/periph/stm32f10x_std_periph.c
static void TI1_Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter);
static void TI2_Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter);
static void TI3_Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter);
static void TI4_Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter);


#define STD_TIM1_BASE             (APB2PERIPH_BASE + 0x2C00)
#define STD_TIM2_BASE             (APB1PERIPH_BASE + 0x0000)
#define STD_TIM3_BASE             (APB1PERIPH_BASE + 0x0400)
#define STD_TIM4_BASE             (APB1PERIPH_BASE + 0x0800)
#define STD_TIM5_BASE             (APB1PERIPH_BASE + 0x0C00)
#define STD_TIM6_BASE             (APB1PERIPH_BASE + 0x1000)
#define STD_TIM7_BASE             (APB1PERIPH_BASE + 0x1400)
#define STD_TIM8_BASE             (APB2PERIPH_BASE + 0x3400)
#define STD_TIM9_BASE             (APB2PERIPH_BASE + 0x4C00)
#define STD_TIM10_BASE            (APB2PERIPH_BASE + 0x5000)
#define STD_TIM11_BASE            (APB2PERIPH_BASE + 0x5400)
#define STD_TIM12_BASE            (APB1PERIPH_BASE + 0x1800)
#define STD_TIM13_BASE            (APB1PERIPH_BASE + 0x1C00)
#define STD_TIM14_BASE            (APB1PERIPH_BASE + 0x2000)
#define STD_TIM15_BASE            (APB2PERIPH_BASE + 0x4000)
#define STD_TIM16_BASE            (APB2PERIPH_BASE + 0x4400)
#define STD_TIM17_BASE            (APB2PERIPH_BASE + 0x4800)


#define STD_TIM1				  ((STD_TIM_TypeDef *) STD_TIM1_BASE)
#define STD_TIM2				  ((STD_TIM_TypeDef *) STD_TIM2_BASE)
#define STD_TIM3				  ((STD_TIM_TypeDef *) STD_TIM3_BASE)
#define STD_TIM4				  ((STD_TIM_TypeDef *) STD_TIM4_BASE)
#define STD_TIM5				  ((STD_TIM_TypeDef *) STD_TIM5_BASE)
#define STD_TIM6				  ((STD_TIM_TypeDef *) STD_TIM6_BASE)
#define STD_TIM7				  ((STD_TIM_TypeDef *) STD_TIM7_BASE)
#define STD_TIM8				  ((STD_TIM_TypeDef *) STD_TIM8_BASE)
#define STD_TIM9				  ((STD_TIM_TypeDef *) STD_TIM9_BASE)
#define STD_TIM10				  ((STD_TIM_TypeDef *) STD_TIM10_BASE)
#define STD_TIM11				  ((STD_TIM_TypeDef *) STD_TIM11_BASE)
#define STD_TIM12				  ((STD_TIM_TypeDef *) STD_TIM12_BASE)
#define STD_TIM13				  ((STD_TIM_TypeDef *) STD_TIM13_BASE)
#define STD_TIM14				  ((STD_TIM_TypeDef *) STD_TIM14_BASE)
#define STD_TIM15               ((STD_TIM_TypeDef *) STD_TIM15_BASE)
#define STD_TIM16               ((STD_TIM_TypeDef *) STD_TIM16_BASE)
#define STD_TIM17               ((STD_TIM_TypeDef *) STD_TIM17_BASE)

void TIM_DeInit(STD_TIM_TypeDef* TIMx);
void TIM_TimeBaseInit(STD_TIM_TypeDef* TIMx, STD_TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct);
void TIM_OC1Init(STD_TIM_TypeDef* TIMx, STD_TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_OC2Init(STD_TIM_TypeDef* TIMx, STD_TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_OC3Init(STD_TIM_TypeDef* TIMx, STD_TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_OC4Init(STD_TIM_TypeDef* TIMx, STD_TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_ICInit(STD_TIM_TypeDef* TIMx, STD_TIM_ICInitTypeDef* TIM_ICInitStruct);
void TIM_PWMIConfig(STD_TIM_TypeDef* TIMx, STD_TIM_ICInitTypeDef* TIM_ICInitStruct);
void TIM_BDTRConfig(STD_TIM_TypeDef* TIMx, STD_TIM_BDTRInitTypeDef *TIM_BDTRInitStruct);
void TIM_TimeBaseStructInit(STD_TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct);
void TIM_OCStructInit(STD_TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_ICStructInit(STD_TIM_ICInitTypeDef* TIM_ICInitStruct);
void TIM_BDTRStructInit(STD_TIM_BDTRInitTypeDef* TIM_BDTRInitStruct);
void TIM_Cmd(STD_TIM_TypeDef* TIMx, FunctionalState NewState);
void TIM_CtrlPWMOutputs(STD_TIM_TypeDef* TIMx, FunctionalState NewState);
void TIM_ITConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_IT, FunctionalState NewState);
void TIM_GenerateEvent(STD_TIM_TypeDef* TIMx, uint16_t TIM_EventSource);
void TIM_DMAConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_DMABase, uint16_t TIM_DMABurstLength);
void TIM_DMACmd(STD_TIM_TypeDef* TIMx, uint16_t TIM_DMASource, FunctionalState NewState);
void TIM_InternalClockConfig(STD_TIM_TypeDef* TIMx);
void TIM_ITRxExternalClockConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource);
void TIM_TIxExternalClockConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_TIxExternalCLKSource,
                                uint16_t TIM_ICPolarity, uint16_t ICFilter);
void TIM_ETRClockMode1Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                             uint16_t ExtTRGFilter);
void TIM_ETRClockMode2Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler,
                             uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter);
void TIM_ETRConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                   uint16_t ExtTRGFilter);
void TIM_PrescalerConfig(STD_TIM_TypeDef* TIMx, uint16_t Prescaler, uint16_t TIM_PSCReloadMode);
void TIM_CounterModeConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_CounterMode);
void TIM_SelectInputTrigger(STD_TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource);
void TIM_EncoderInterfaceConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_EncoderMode,
                                uint16_t TIM_IC1Polarity, uint16_t TIM_IC2Polarity);
void TIM_ForcedOC1Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction);
void TIM_ForcedOC2Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction);
void TIM_ForcedOC3Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction);
void TIM_ForcedOC4Config(STD_TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction);
void TIM_ARRPreloadConfig(STD_TIM_TypeDef* TIMx, FunctionalState NewState);
void TIM_SelectCOM(STD_TIM_TypeDef* TIMx, FunctionalState NewState);
void TIM_SelectCCDMA(STD_TIM_TypeDef* TIMx, FunctionalState NewState);
void TIM_CCPreloadControl(STD_TIM_TypeDef* TIMx, FunctionalState NewState);
void TIM_OC1PreloadConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCPreload);
void TIM_OC2PreloadConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCPreload);
void TIM_OC3PreloadConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCPreload);
void TIM_OC4PreloadConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCPreload);
void TIM_OC1FastConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCFast);
void TIM_OC2FastConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCFast);
void TIM_OC3FastConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCFast);
void TIM_OC4FastConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCFast);
void TIM_ClearOC1Ref(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCClear);
void TIM_ClearOC2Ref(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCClear);
void TIM_ClearOC3Ref(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCClear);
void TIM_ClearOC4Ref(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCClear);
void TIM_OC1PolarityConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity);
void TIM_OC1NPolarityConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity);
void TIM_OC2PolarityConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity);
void TIM_OC2NPolarityConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity);
void TIM_OC3PolarityConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity);
void TIM_OC3NPolarityConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity);
void TIM_OC4PolarityConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity);
void TIM_CCxCmd(STD_TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_CCx);
void TIM_CCxNCmd(STD_TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_CCxN);
void TIM_SelectOCxM(STD_TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_OCMode);
void TIM_UpdateDisableConfig(STD_TIM_TypeDef* TIMx, FunctionalState NewState);
void TIM_UpdateRequestConfig(STD_TIM_TypeDef* TIMx, uint16_t TIM_UpdateSource);
void TIM_SelectHallSensor(STD_TIM_TypeDef* TIMx, FunctionalState NewState);
void TIM_SelectOnePulseMode(STD_TIM_TypeDef* TIMx, uint16_t TIM_OPMode);
void TIM_SelectOutputTrigger(STD_TIM_TypeDef* TIMx, uint16_t TIM_TRGOSource);
void TIM_SelectSlaveMode(STD_TIM_TypeDef* TIMx, uint16_t TIM_SlaveMode);
void TIM_SelectMasterSlaveMode(STD_TIM_TypeDef* TIMx, uint16_t TIM_MasterSlaveMode);
void TIM_SetCounter(STD_TIM_TypeDef* TIMx, uint16_t Counter);
void TIM_SetAutoreload(STD_TIM_TypeDef* TIMx, uint16_t Autoreload);
void TIM_SetCompare1(STD_TIM_TypeDef* TIMx, uint16_t Compare1);
void TIM_SetCompare2(STD_TIM_TypeDef* TIMx, uint16_t Compare2);
void TIM_SetCompare3(STD_TIM_TypeDef* TIMx, uint16_t Compare3);
void TIM_SetCompare4(STD_TIM_TypeDef* TIMx, uint16_t Compare4);
void TIM_SetIC1Prescaler(STD_TIM_TypeDef* TIMx, uint16_t TIM_ICPSC);
void TIM_SetIC2Prescaler(STD_TIM_TypeDef* TIMx, uint16_t TIM_ICPSC);
void TIM_SetIC3Prescaler(STD_TIM_TypeDef* TIMx, uint16_t TIM_ICPSC);
void TIM_SetIC4Prescaler(STD_TIM_TypeDef* TIMx, uint16_t TIM_ICPSC);
void TIM_SetClockDivision(STD_TIM_TypeDef* TIMx, uint16_t TIM_CKD);
uint16_t TIM_GetCapture1(STD_TIM_TypeDef* TIMx);
uint16_t TIM_GetCapture2(STD_TIM_TypeDef* TIMx);
uint16_t TIM_GetCapture3(STD_TIM_TypeDef* TIMx);
uint16_t TIM_GetCapture4(STD_TIM_TypeDef* TIMx);
uint16_t TIM_GetCounter(STD_TIM_TypeDef* TIMx);
uint16_t TIM_GetPrescaler(STD_TIM_TypeDef* TIMx);
FlagStatus TIM_GetFlagStatus(STD_TIM_TypeDef* TIMx, uint16_t TIM_FLAG);
void TIM_ClearFlag(STD_TIM_TypeDef* TIMx, uint16_t TIM_FLAG);
ITStatus TIM_GetITStatus(STD_TIM_TypeDef* TIMx, uint16_t TIM_IT);
void TIM_ClearITPendingBit(STD_TIM_TypeDef* TIMx, uint16_t TIM_IT);


/**
  * @brief  Deinitializes the TIMx peripheral registers to their default reset values.
  * @param  TIMx: where x can be 1 to 17 to select the TIM peripheral.
  * @retval None
  */
void TIM_DeInit(STD_TIM_TypeDef* TIMx)
{
  /* Check the parameters */
  assert_param(IS_TIM_ALL_PERIPH(TIMx));

