kex2017/ad7606/stm32_src/RIOT/cpu/stm32f1/periph/stm32f10x_std_periph.c
  if (TIMx == STD_TIM1)
  {
	  periph_clk_en(APB2,RCC_APB2Periph_TIM1);
	  periph_clk_dis(APB2,RCC_APB2Periph_TIM1);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM1, ENABLE);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM1, DISABLE);
  }
  else if (TIMx == STD_TIM2)
  {
	  periph_clk_en(APB1,RCC_APB1Periph_TIM2);
	  periph_clk_dis(APB1,RCC_APB1Periph_TIM2);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM2, ENABLE);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM2, DISABLE);
  }
  else if (TIMx == STD_TIM3)
  {
	  periph_clk_en(APB1,RCC_APB1Periph_TIM3);
	  periph_clk_dis(APB1,RCC_APB1Periph_TIM3);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM3, ENABLE);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM3, DISABLE);
  }
  else if (TIMx == STD_TIM4)
  {
	  periph_clk_en(APB1,RCC_APB1Periph_TIM4);
	  periph_clk_dis(APB1,RCC_APB1Periph_TIM4);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM4, ENABLE);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM4, DISABLE);
  }
  else if (TIMx == STD_TIM5)
  {
	  periph_clk_en(APB1,RCC_APB1Periph_TIM5);
	  periph_clk_dis(APB1,RCC_APB1Periph_TIM5);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM5, ENABLE);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM5, DISABLE);
  }
  else if (TIMx == STD_TIM6)
  {
	  periph_clk_en(APB1,RCC_APB1Periph_TIM6);
	  periph_clk_dis(APB1,RCC_APB1Periph_TIM6);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM6, ENABLE);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM6, DISABLE);
  }
  else if (TIMx == STD_TIM7)
  {
	  periph_clk_en(APB1,RCC_APB1Periph_TIM7);
	  periph_clk_dis(APB1,RCC_APB1Periph_TIM7);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM7, ENABLE);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM7, DISABLE);
  }
  else if (TIMx == STD_TIM8)
  {
	  periph_clk_en(APB2,RCC_APB2Periph_TIM8);
	  periph_clk_dis(APB2,RCC_APB2Periph_TIM8);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM8, ENABLE);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM8, DISABLE);
  }
  else if (TIMx == STD_TIM9)
  {
	  periph_clk_en(APB2,RCC_APB2Periph_TIM9);
	  periph_clk_dis(APB2,RCC_APB2Periph_TIM9);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM9, ENABLE);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM9, DISABLE);
   }
  else if (TIMx == STD_TIM10)
  {
	  periph_clk_en(APB2,RCC_APB2Periph_TIM10);
	  periph_clk_dis(APB2,RCC_APB2Periph_TIM10);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM10, ENABLE);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM10, DISABLE);
  }
  else if (TIMx == STD_TIM11)
  {
	  periph_clk_en(APB2,RCC_APB2Periph_TIM11);
	  periph_clk_dis(APB2,RCC_APB2Periph_TIM11);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM11, ENABLE);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM11, DISABLE);
  }
  else if (TIMx == STD_TIM12)
  {
	  periph_clk_en(APB1,RCC_APB1Periph_TIM12);
	  periph_clk_dis(APB1,RCC_APB1Periph_TIM12);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM12, ENABLE);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM12, DISABLE);
  }
  else if (TIMx == STD_TIM13)
  {
	  periph_clk_en(APB1,RCC_APB1Periph_TIM13);
	  periph_clk_dis(APB1,RCC_APB1Periph_TIM13);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM13, ENABLE);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM13, DISABLE);
  }
  else if (TIMx == STD_TIM14)
  {
	  periph_clk_en(APB1,RCC_APB1Periph_TIM14);
	  periph_clk_dis(APB1,RCC_APB1Periph_TIM14);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM14, ENABLE);
//    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIM14, DISABLE);
  }
  else if (TIMx == STD_TIM15)
  {
	  periph_clk_en(APB2,RCC_APB2Periph_TIM15);
	  periph_clk_dis(APB2,RCC_APB2Periph_TIM15);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM15, ENABLE);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM15, DISABLE);
  }
  else if (TIMx == STD_TIM16)
  {
	  periph_clk_en(APB2,RCC_APB2Periph_TIM16);
	  periph_clk_dis(APB2,RCC_APB2Periph_TIM16);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM16, ENABLE);
//    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM16, DISABLE);
  }
  else
  {
    if (TIMx == STD_TIM17)
    {
  	  periph_clk_en(APB2,RCC_APB2Periph_TIM17);
  	  periph_clk_dis(APB2,RCC_APB2Periph_TIM17);
//      RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM17, ENABLE);
//      RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM17, DISABLE);
    }
  }
}

/**
  * @brief  Initializes the TIMx Time Base Unit peripheral according to
  *         the specified parameters in the TIM_TimeBaseInitStruct.
  * @param  TIMx: where x can be 1 to 17 to select the TIM peripheral.
  * @param  TIM_TimeBaseInitStruct: pointer to a TIM_TimeBaseInitTypeDef
  *         structure that contains the configuration information for the
  *         specified TIM peripheral.
  * @retval None
  */
void TIM_TimeBaseInit(STD_TIM_TypeDef* TIMx, STD_TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct)
{
  uint16_t tmpcr1 = 0;

  /* Check the parameters */
  assert_param(IS_TIM_ALL_PERIPH(TIMx));
  assert_param(IS_TIM_COUNTER_MODE(TIM_TimeBaseInitStruct->TIM_CounterMode));
  assert_param(IS_TIM_CKD_DIV(TIM_TimeBaseInitStruct->TIM_ClockDivision));

  tmpcr1 = TIMx->CR1;

  if((TIMx == STD_TIM1) || (TIMx == STD_TIM8)|| (TIMx == STD_TIM2) || (TIMx == STD_TIM3)||
     (TIMx == STD_TIM4) || (TIMx == STD_TIM5))
  {
    /* Select the Counter Mode */
    tmpcr1 &= (uint16_t)(~((uint16_t)(TIM_CR1_DIR | TIM_CR1_CMS)));
    tmpcr1 |= (uint32_t)TIM_TimeBaseInitStruct->TIM_CounterMode;
  }

  if((TIMx != STD_TIM6) && (TIMx != STD_TIM7))
  {
    /* Set the clock division */
    tmpcr1 &= (uint16_t)(~((uint16_t)TIM_CR1_CKD));
    tmpcr1 |= (uint32_t)TIM_TimeBaseInitStruct->TIM_ClockDivision;
  }

  TIMx->CR1 = tmpcr1;

  /* Set the Autoreload value */
  TIMx->ARR = TIM_TimeBaseInitStruct->TIM_Period ;

  /* Set the Prescaler value */
  TIMx->PSC = TIM_TimeBaseInitStruct->TIM_Prescaler;

  if ((TIMx == STD_TIM1) || (TIMx == STD_TIM8)|| (TIMx == STD_TIM15)|| (TIMx == STD_TIM16) || (TIMx == STD_TIM17))
  {
    /* Set the Repetition Counter value */
    TIMx->RCR = TIM_TimeBaseInitStruct->TIM_RepetitionCounter;
  }

  /* Generate an update event to reload the Prescaler and the Repetition counter
     values immediately */
  TIMx->EGR = TIM_PSCReloadMode_Immediate;
}

/**
  * @brief  Initializes the TIMx Channel1 according to the specified
  *         parameters in the TIM_OCInitStruct.
  * @param  TIMx: where x can be  1 to 17 except 6 and 7 to select the TIM peripheral.
  * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure
  *         that contains the configuration information for the specified TIM peripheral.
  * @retval None
  */
void TIM_OC1Init(STD_TIM_TypeDef* TIMx, STD_TIM_OCInitTypeDef* TIM_OCInitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  /* Check the parameters */
  assert_param(IS_TIM_LIST8_PERIPH(TIMx));
  assert_param(IS_TIM_OC_MODE(TIM_OCInitStruct->TIM_OCMode));
  assert_param(IS_TIM_OUTPUT_STATE(TIM_OCInitStruct->TIM_OutputState));
  assert_param(IS_TIM_OC_POLARITY(TIM_OCInitStruct->TIM_OCPolarity));
 /* Disable the Channel 1: Reset the CC1E Bit */
  TIMx->CCER &= (uint16_t)(~(uint16_t)TIM_CCER_CC1E);
  /* Get the TIMx CCER register value */
  tmpccer = TIMx->CCER;
  /* Get the TIMx CR2 register value */
  tmpcr2 =  TIMx->CR2;

  /* Get the TIMx CCMR1 register value */
  tmpccmrx = TIMx->CCMR1;

  /* Reset the Output Compare Mode Bits */
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CCMR1_OC1M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CCMR1_CC1S));

  /* Select the Output Compare Mode */
  tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;

  /* Reset the Output Polarity level */
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CCER_CC1P));
  /* Set the Output Compare Polarity */
  tmpccer |= TIM_OCInitStruct->TIM_OCPolarity;

  /* Set the Output State */
  tmpccer |= TIM_OCInitStruct->TIM_OutputState;

  if((TIMx == STD_TIM1) || (TIMx == STD_TIM8)|| (TIMx == STD_TIM15)||
     (TIMx == STD_TIM16)|| (TIMx == STD_TIM17))
  {
    assert_param(IS_TIM_OUTPUTN_STATE(TIM_OCInitStruct->TIM_OutputNState));
    assert_param(IS_TIM_OCN_POLARITY(TIM_OCInitStruct->TIM_OCNPolarity));
    assert_param(IS_TIM_OCNIDLE_STATE(TIM_OCInitStruct->TIM_OCNIdleState));
    assert_param(IS_TIM_OCIDLE_STATE(TIM_OCInitStruct->TIM_OCIdleState));

    /* Reset the Output N Polarity level */
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CCER_CC1NP));
    /* Set the Output N Polarity */
    tmpccer |= TIM_OCInitStruct->TIM_OCNPolarity;

    /* Reset the Output N State */
    tmpccer &= (uint16_t)(~((uint16_t)TIM_CCER_CC1NE));
    /* Set the Output N State */
    tmpccer |= TIM_OCInitStruct->TIM_OutputNState;

    /* Reset the Output Compare and Output Compare N IDLE State */
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_CR2_OIS1));
    tmpcr2 &= (uint16_t)(~((uint16_t)TIM_CR2_OIS1N));

    /* Set the Output Idle state */
    tmpcr2 |= TIM_OCInitStruct->TIM_OCIdleState;
    /* Set the Output N Idle state */
    tmpcr2 |= TIM_OCInitStruct->TIM_OCNIdleState;
  }
  /* Write to TIMx CR2 */
  TIMx->CR2 = tmpcr2;

  /* Write to TIMx CCMR1 */
  TIMx->CCMR1 = tmpccmrx;

  /* Set the Capture Compare Register value */
  TIMx->CCR1 = TIM_OCInitStruct->TIM_Pulse;

  /* Write to TIMx CCER */
  TIMx->CCER = tmpccer;
}

/**
  * @brief  Initializes the TIMx Channel2 according to the specified
  *         parameters in the TIM_OCInitStruct.
  * @param  TIMx: where x can be  1, 2, 3, 4, 5, 8, 9, 12 or 15 to select
  *         the TIM peripheral.
  * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure
  *         that contains the configuration information for the specified TIM peripheral.
  * @retval None
  */
void TIM_OC2Init(STD_TIM_TypeDef* TIMx, STD_TIM_OCInitTypeDef* TIM_OCInitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  /* Check the parameters */
  assert_param(IS_TIM_LIST6_PERIPH(TIMx));
  assert_param(IS_TIM_OC_MODE(TIM_OCInitStruct->TIM_OCMode));
  assert_param(IS_TIM_OUTPUT_STATE(TIM_OCInitStruct->TIM_OutputState));
  assert_param(IS_TIM_OC_POLARITY(TIM_OCInitStruct->TIM_OCPolarity));
   /* Disable the Channel 2: Reset the CC2E Bit */
  TIMx->CCER &= (uint16_t)(~((uint16_t)TIM_CCER_CC2E));

  /* Get the TIMx CCER register value */
  tmpccer = TIMx->CCER;
  /* Get the TIMx CR2 register value */
  tmpcr2 =  TIMx->CR2;

  /* Get the TIMx CCMR1 register value */
  tmpccmrx = TIMx->CCMR1;

  /* Reset the Output Compare mode and Capture/Compare selection Bits */
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CCMR1_OC2M));
  tmpccmrx &= (uint16_t)(~((uint16_t)TIM_CCMR1_CC2S));

  /* Select the Output Compare Mode */
  tmpccmrx |= (uint16_t)(TIM_OCInitStruct->TIM_OCMode << 8);

  /* Reset the Output Polarity level */
  tmpccer &= (uint16_t)(~((uint16_t)TIM_CCER_CC2P));
  /* Set the Output Compare Polarity */
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 4);

  /* Set the Output State */
  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 4);

