kex2017/ad7606/stm32_src/RIOT/cpu/stm32f1/periph/stm32f10x_std_periph.c
/** @defgroup PWR_Flag
  * @{
  */

#define PWR_FLAG_WU               ((uint32_t)0x00000001)
#define PWR_FLAG_SB               ((uint32_t)0x00000002)
#define PWR_FLAG_PVDO             ((uint32_t)0x00000004)
#define IS_PWR_GET_FLAG(FLAG) (((FLAG) == PWR_FLAG_WU) || ((FLAG) == PWR_FLAG_SB) || \
                               ((FLAG) == PWR_FLAG_PVDO))

#define IS_PWR_CLEAR_FLAG(FLAG) (((FLAG) == PWR_FLAG_WU) || ((FLAG) == PWR_FLAG_SB))


/* --------- PWR registers bit address in the alias region ---------- */
#define PWR_OFFSET               (PWR_BASE - PERIPH_BASE)

/* --- CR Register ---*/

/* Alias word address of DBP bit */
#define CR_OFFSET                (PWR_OFFSET + 0x00)
#define DBP_BitNumber            0x08
#define CR_DBP_BB                (PERIPH_BB_BASE + (CR_OFFSET * 32) + (DBP_BitNumber * 4))

/* Alias word address of PVDE bit */
#define PVDE_BitNumber           0x04
#define CR_PVDE_BB               (PERIPH_BB_BASE + (CR_OFFSET * 32) + (PVDE_BitNumber * 4))

/* --- CSR Register ---*/

/* Alias word address of EWUP bit */
#define CSR_OFFSET               (PWR_OFFSET + 0x04)
#define EWUP_BitNumber           0x08
#define CSR_EWUP_BB              (PERIPH_BB_BASE + (CSR_OFFSET * 32) + (EWUP_BitNumber * 4))

/* ------------------ PWR registers bit mask ------------------------ */

/* CR register bit mask */
#define CR_DS_MASK               ((uint32_t)0xFFFFFFFC)
#define CR_PLS_MASK              ((uint32_t)0xFFFFFF1F)


/**
  * @brief  Deinitializes the PWR peripheral registers to their default reset values.
  * @param  None
  * @retval None
  */
void PWR_DeInit(void)
{
	  periph_clk_en(APB1,RCC_APB1Periph_PWR);
	  periph_clk_dis(APB1,RCC_APB1Periph_PWR);

//  RCC_APB1PeriphResetCmd(RCC_APB1Periph_PWR, ENABLE);
//  RCC_APB1PeriphResetCmd(RCC_APB1Periph_PWR, DISABLE);
}

/**
  * @brief  Enables or disables access to the RTC and backup registers.
  * @param  NewState: new state of the access to the RTC and backup registers.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void PWR_BackupAccessCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) CR_DBP_BB = (uint32_t)NewState;
}

/**
  * @brief  Enables or disables the Power Voltage Detector(PVD).
  * @param  NewState: new state of the PVD.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void PWR_PVDCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) CR_PVDE_BB = (uint32_t)NewState;
}

/**
  * @brief  Configures the voltage threshold detected by the Power Voltage Detector(PVD).
  * @param  PWR_PVDLevel: specifies the PVD detection level
  *   This parameter can be one of the following values:
  *     @arg PWR_PVDLevel_2V2: PVD detection level set to 2.2V
  *     @arg PWR_PVDLevel_2V3: PVD detection level set to 2.3V
  *     @arg PWR_PVDLevel_2V4: PVD detection level set to 2.4V
  *     @arg PWR_PVDLevel_2V5: PVD detection level set to 2.5V
  *     @arg PWR_PVDLevel_2V6: PVD detection level set to 2.6V
  *     @arg PWR_PVDLevel_2V7: PVD detection level set to 2.7V
  *     @arg PWR_PVDLevel_2V8: PVD detection level set to 2.8V
  *     @arg PWR_PVDLevel_2V9: PVD detection level set to 2.9V
  * @retval None
  */
void PWR_PVDLevelConfig(uint32_t PWR_PVDLevel)
{
  uint32_t tmpreg = 0;
  /* Check the parameters */
  assert_param(IS_PWR_PVD_LEVEL(PWR_PVDLevel));
  tmpreg = PWR->CR;
  /* Clear PLS[7:5] bits */
  tmpreg &= CR_PLS_MASK;
  /* Set PLS[7:5] bits according to PWR_PVDLevel value */
  tmpreg |= PWR_PVDLevel;
  /* Store the new value */
  PWR->CR = tmpreg;
}

/**
  * @brief  Enables or disables the WakeUp Pin functionality.
  * @param  NewState: new state of the WakeUp Pin functionality.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void PWR_WakeUpPinCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) CSR_EWUP_BB = (uint32_t)NewState;
}

/**
  * @brief  Enters STOP mode.
  * @param  PWR_Regulator: specifies the regulator state in STOP mode.
  *   This parameter can be one of the following values:
  *     @arg PWR_Regulator_ON: STOP mode with regulator ON
  *     @arg PWR_Regulator_LowPower: STOP mode with regulator in low power mode
  * @param  PWR_STOPEntry: specifies if STOP mode in entered with WFI or WFE instruction.
  *   This parameter can be one of the following values:
  *     @arg PWR_STOPEntry_WFI: enter STOP mode with WFI instruction
  *     @arg PWR_STOPEntry_WFE: enter STOP mode with WFE instruction
  * @retval None
  */
void PWR_EnterSTOPMode(uint32_t PWR_Regulator, uint8_t PWR_STOPEntry)
{
  uint32_t tmpreg = 0;
  /* Check the parameters */
  assert_param(IS_PWR_REGULATOR(PWR_Regulator));
  assert_param(IS_PWR_STOP_ENTRY(PWR_STOPEntry));

  /* Select the regulator state in STOP mode ---------------------------------*/
  tmpreg = PWR->CR;
  /* Clear PDDS and LPDS bits */
  tmpreg &= CR_DS_MASK;
  /* Set LPDS bit according to PWR_Regulator value */
  tmpreg |= PWR_Regulator;
  /* Store the new value */
  PWR->CR = tmpreg;
  /* Set SLEEPDEEP bit of Cortex System Control Register */
  SCB->SCR |= SCB_SCR_SLEEPDEEP;

  /* Select STOP mode entry --------------------------------------------------*/
  if(PWR_STOPEntry == PWR_STOPEntry_WFI)
  {
    /* Request Wait For Interrupt */
    __WFI();
  }
  else
  {
    /* Request Wait For Event */
    __WFE();
  }

  /* Reset SLEEPDEEP bit of Cortex System Control Register */
  SCB->SCR &= (uint32_t)~((uint32_t)SCB_SCR_SLEEPDEEP);
}

/**
  * @brief  Enters STANDBY mode.
  * @param  None
  * @retval None
  */
void PWR_EnterSTANDBYMode(void)
{
  /* Clear Wake-up flag */
  PWR->CR |= PWR_CR_CWUF;
  /* Select STANDBY mode */
  PWR->CR |= PWR_CR_PDDS;
  /* Set SLEEPDEEP bit of Cortex System Control Register */
  SCB->SCR |= SCB_SCR_SLEEPDEEP;
/* This option is used to ensure that store operations are completed */
#if defined ( __CC_ARM   )
  __force_stores();
#endif
  /* Request Wait For Interrupt */
  __WFI();
}

/**
  * @brief  Checks whether the specified PWR flag is set or not.
  * @param  PWR_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg PWR_FLAG_WU: Wake Up flag
  *     @arg PWR_FLAG_SB: StandBy flag
  *     @arg PWR_FLAG_PVDO: PVD Output
  * @retval The new state of PWR_FLAG (SET or RESET).
  */
FlagStatus PWR_GetFlagStatus(uint32_t PWR_FLAG)
{
  FlagStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_PWR_GET_FLAG(PWR_FLAG));

  if ((PWR->CSR & PWR_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  /* Return the flag status */
  return bitstatus;
}

/**
  * @brief  Clears the PWR's pending flags.
  * @param  PWR_FLAG: specifies the flag to clear.
  *   This parameter can be one of the following values:
  *     @arg PWR_FLAG_WU: Wake Up flag
  *     @arg PWR_FLAG_SB: StandBy flag
  * @retval None
  */
void PWR_ClearFlag(uint32_t PWR_FLAG)
{
  /* Check the parameters */
  assert_param(IS_PWR_CLEAR_FLAG(PWR_FLAG));

  PWR->CR |=  PWR_FLAG << 2;
}


//USER FUNC
#define ADC1_C0 GPIO_PIN(PORT_A,0)
#define ADC1_C1 GPIO_PIN(PORT_A,1)
#define ADC1_C2 GPIO_PIN(PORT_A,2)
#define ADC1_C3 GPIO_PIN(PORT_A,3)
#define ADC1_C4 GPIO_PIN(PORT_A,4)
#define ADC1_C5 GPIO_PIN(PORT_A,5)
#define ADC1_C6 GPIO_PIN(PORT_A,6)
#define ADC1_C7 GPIO_PIN(PORT_A,7)
#define ADC1_C8 GPIO_PIN(PORT_B,0)
#define ADC1_C9 GPIO_PIN(PORT_B,1)
#define ADC1_C10 GPIO_PIN(PORT_C,0)
#define ADC1_C11 GPIO_PIN(PORT_C,1)
#define ADC1_C12 GPIO_PIN(PORT_C,2)
#define ADC1_C13 GPIO_PIN(PORT_C,3)
#define ADC1_C14 GPIO_PIN(PORT_C,4)
#define ADC1_C15 GPIO_PIN(PORT_C,5)

int adc1_dma1_tim4_sample_adc1_pin_init(uint16_t channel_num)
{
	switch(channel_num)
	{
		case 0: gpio_init(ADC1_C0, GPIO_IN);break;
		case 1: gpio_init(ADC1_C1, GPIO_IN);break;
		case 2: gpio_init(ADC1_C2, GPIO_IN);break;
		case 3: gpio_init(ADC1_C3, GPIO_IN);break;
		case 4: gpio_init(ADC1_C4, GPIO_IN);break;
		case 5: gpio_init(ADC1_C5, GPIO_IN);break;
		case 6: gpio_init(ADC1_C6, GPIO_IN);break;
		case 7: gpio_init(ADC1_C7, GPIO_IN);break;
		case 8: gpio_init(ADC1_C8, GPIO_IN);break;
		case 9: gpio_init(ADC1_C9, GPIO_IN);break;
		case 10: gpio_init(ADC1_C10, GPIO_IN);break;
		case 11: gpio_init(ADC1_C11, GPIO_IN);break;
		case 12: gpio_init(ADC1_C12, GPIO_IN);break;
		case 13: gpio_init(ADC1_C13, GPIO_IN);break;
		case 14: gpio_init(ADC1_C14, GPIO_IN);break;
		case 15: gpio_init(ADC1_C15, GPIO_IN);break;
		default: return -1;
	}
	return 0;
}


int adc1_dma1_tim4_sample_adc1_pins_init(uint16_t *channel_list,uint16_t channel_count)
{
	int i = 0;
	for (i=0;i<channel_count;i++)
	{
		if(adc1_dma1_tim4_sample_adc1_pin_init(channel_list[i]) < 0)
		{
			return -1;
		}
	}
	return 0;
}

void adc1_dma1_tim4_sample_adc1_init(uint16_t *channel_list,uint16_t channel_count)
{
	   STD_ADC_InitTypeDef ADC_InitStructure;
	   ADC_DeInit(ADC1);
	   periph_clk_en(APB2, RCC_APB2Periph_ADC1);
	   RCC_ADCCLKConfig(RCC_PCLK2_Div6); //设置ADC时钟（ADCCLK） 72MHZ/6 = 12MHZ

	   ADC_InitStructure.ADC_Mode = ADC_Mode_Independent; //独立模式
	   ADC_InitStructure.ADC_ScanConvMode = ENABLE; //DISABLE单次模式(单通道) ENABLE多次模式
	   ADC_InitStructure.ADC_ContinuousConvMode = DISABLE; //关闭连续模式
	   ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T4_CC4; //转换由TIM4触发
	   ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right; //ADC数据右对齐
	   ADC_InitStructure.ADC_NbrOfChannel = channel_count; //规则转换的ADC的通道数目,取值范围为1-16
	   ADC_Init(ADC1, &ADC_InitStructure); //初始化配置

	   int i = 0;
	   for(i=0;i<channel_count;i++)
	   {
		   ADC_RegularChannelConfig(ADC1, channel_list[i], i+1, ADC_SampleTime_239Cycles5);
	   }

