kex2017/ad7606/stm32_src/RIOT/cpu/stm32f1/periph/stm32f10x_std_periph.c
	   ADC_DMACmd(ADC1, ENABLE);

	   ADC_Cmd(ADC1, ENABLE);

	   ADC_ResetCalibration(ADC1);
	   while (ADC_GetResetCalibrationStatus(ADC1) == SET)
	      ; //获取ADC重置校准寄存器的状态 等待复位结束
	   ADC_StartCalibration(ADC1); //开始指定ADC的校准状态
	   while (ADC_GetCalibrationStatus(ADC1) == SET)
	      ;
	   ADC_ExternalTrigConvCmd(ADC1, ENABLE);
}


void adc1_dma1_tim4_sample_adc1_dma1_init(uint16_t channel_count,uint16_t sample_count,uint16_t *sample_buf)
{
   STD_DMA_InitTypeDef DMA_InitStructure;
   periph_clk_en(AHB, RCC_AHBPeriph_DMA1);
   //ADC1 DMA channel 1
   DMA_DeInit(DMA1_Channel1);
   DMA_InitStructure.DMA_PeripheralBaseAddr =  (uint32_t)&ADC1->DR;
   DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t) sample_buf;
   DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
   DMA_InitStructure.DMA_BufferSize = channel_count * sample_count;
   DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable; //接收一次数据后，设备地址禁止后移
   DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable; //  内存自增
   DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord; //16位
   DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord; //16位
   DMA_InitStructure.DMA_Mode = DMA_Mode_Circular; //DMA normal
   DMA_InitStructure.DMA_Priority = DMA_Priority_High;  //DMA优先级高
   DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
   DMA_Init(DMA1_Channel1, &DMA_InitStructure);

   NVIC_EnableIRQ(DMA1_Channel1_IRQn);

   DMA_ITConfig(DMA1_Channel1, DMA_IT_TC, ENABLE);  //使能或者失能指定的通道x中断(DMA1 通道1)
   /* Enable DMA1 channel1 */
   DMA_Cmd(DMA1_Channel1, ENABLE);
}

void adc1_dma1_tim4_sample_tim4_init(uint16_t sample_count,uint16_t sample_duration_ms)
{
	uint16_t sample_period_us = sample_duration_ms*1000/sample_count;

	STD_TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	STD_TIM_OCInitTypeDef TIM_OCInitStructure;
	periph_clk_en(APB1, RCC_APB1Periph_TIM4);

	TIM_TimeBaseStructure.TIM_Period = sample_period_us; /* 自动重装载寄存器周期的值(计数值) */
	/* 累计 TIM_Period个频率后产生一个更新或者中断 */
	TIM_TimeBaseStructure.TIM_Prescaler = (72-1);  //系统主频72M，这里分频72，相当于1000K的定时器2时钟
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; /* 采样分频 */
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; /* 向上计数模式 */
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(STD_TIM4, &TIM_TimeBaseStructure);

	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;        //PWM模式1
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;        //使能

	TIM_OCInitStructure.TIM_Pulse = 20;        //脉冲宽度,由这个设置占空比
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;        //LOW电平有效

	TIM_OC4Init(STD_TIM4, &TIM_OCInitStructure);        //初始化

	TIM_Cmd(STD_TIM4, ENABLE);

	TIM_InternalClockConfig(STD_TIM4);
	TIM_OC2PreloadConfig(STD_TIM4, TIM_OCPreload_Enable);
	TIM_UpdateDisableConfig(STD_TIM4, DISABLE);
}

int adc1_dma1_tim4_sample_condition_check(uint16_t channel_count,uint16_t sample_count,uint16_t sample_duration_ms)
{
	uint16_t sample_period_us = sample_duration_ms*1000/sample_count;
	uint16_t sample_period_time_us_needed = (252*channel_count) / (72/6); //252 = 239.5+12.5
	if(sample_period_us < sample_period_time_us_needed)
	{
		return -1;
	}

	return 0;
}

int adc1_dma1_tim4_sample_init(uint16_t *channel_list,uint16_t channel_count,uint16_t sample_count,uint16_t sample_duration_ms,uint16_t *sample_buf)
{
	if(adc1_dma1_tim4_sample_condition_check(channel_count,sample_count,sample_duration_ms) < 0)
	{
//		printf("[STM32F10X STD PERIPH]: adc1 dma1 tim4 sample condition check failed\r\n");
		return -1;
	}

	if(adc1_dma1_tim4_sample_adc1_pins_init(channel_list,channel_count) < 0)
	{
//		printf("[STM32F10X STD PERIPH]: adc1 dma1 tim4 sample adc1 pins init failed\r\n");
		return -1;
	}
	adc1_dma1_tim4_sample_adc1_init(channel_list,channel_count);
	adc1_dma1_tim4_sample_adc1_dma1_init(channel_count,sample_count,sample_buf);
	adc1_dma1_tim4_sample_tim4_init(sample_count,sample_duration_ms);
	return 0;
}

adc1_dma1_tim4_sample_done_cb_t isr_cb = NULL;
void set_adc1_dma1_tim4_sample_done_cb(adc1_dma1_tim4_sample_done_cb_t cb)
{
	isr_cb = cb;
}

void isr_dma1_channel1(void) {
    if (DMA_GetITStatus(DMA1_IT_TC1) != RESET) {
        TIM_Cmd(STD_TIM4, DISABLE);
        if(isr_cb != NULL)
        {
            isr_cb();
        }
//        printf("[STM32F10X STD PERIPH]: isr_dma1_channel1\r\n");
    }
    DMA_ClearITPendingBit(DMA1_IT_TC1);
}


void adc1_dma1_tim4_sample_enable(void)
{
	TIM_Cmd(STD_TIM4, ENABLE);
}

void adc1_dma1_tim4_sample_disable(void)
{
	TIM_Cmd(STD_TIM4, DISABLE);
}


int adc1_temp_sensor_init(void)
{
	STD_ADC_InitTypeDef ADC_InitStructure;
	ADC_DeInit(ADC1);
	periph_clk_en(APB2, RCC_APB2Periph_ADC1);
	RCC_ADCCLKConfig(RCC_PCLK2_Div6); //设置ADC时钟（ADCCLK） 72MHZ/6 = 12MHZ

	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent; //独立模式
	ADC_InitStructure.ADC_ScanConvMode = DISABLE; //DISABLE单次模式(单通道) ENABLE多次模式
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE; //关闭连续模式
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right; //ADC数据右对齐
	ADC_InitStructure.ADC_NbrOfChannel = 1; //规则转换的ADC的通道数目,取值范围为1-16

	ADC_Init(ADC1, &ADC_InitStructure); //初始化ADC1配置

	ADC_RegularChannelConfig(ADC1,ADC_Channel_16,1,ADC_SampleTime_239Cycles5);
	ADC_TempSensorVrefintCmd(ENABLE);

	ADC_Cmd(ADC1, ENABLE); // enable adc

	ADC_ResetCalibration(ADC1);
	while (ADC_GetResetCalibrationStatus(ADC1) == SET)
		; //获取ADC重置校准寄存器的状态 等待复位结束
	ADC_StartCalibration(ADC1); //开始指定ADC的校准状态
	while (ADC_GetCalibrationStatus(ADC1) == SET)
		;

	return 0;
}

float adc1_temp_sensor_sample(void)
{
    uint16_t temp = 0;
    float temperate = 0.0;

    ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);

    while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET)
        ;
    temp = ADC_GetConversionValue(ADC1);

    temperate=(float)temp*(3.3/4096);
    temperate=(1.42-temperate)*1000/4.35+25;
    return temperate;
}



#define ADC2_C0 GPIO_PIN(PORT_A,0)
#define ADC2_C1 GPIO_PIN(PORT_A,1)
#define ADC2_C2 GPIO_PIN(PORT_A,2)
#define ADC2_C3 GPIO_PIN(PORT_A,3)
#define ADC2_C4 GPIO_PIN(PORT_A,4)
#define ADC2_C5 GPIO_PIN(PORT_A,5)
#define ADC2_C6 GPIO_PIN(PORT_A,6)
#define ADC2_C7 GPIO_PIN(PORT_A,7)
#define ADC2_C8 GPIO_PIN(PORT_B,0)
#define ADC2_C9 GPIO_PIN(PORT_B,1)
#define ADC2_C10 GPIO_PIN(PORT_C,0)
#define ADC2_C11 GPIO_PIN(PORT_C,1)
#define ADC2_C12 GPIO_PIN(PORT_C,2)
#define ADC2_C13 GPIO_PIN(PORT_C,3)
#define ADC2_C14 GPIO_PIN(PORT_C,4)
#define ADC2_C15 GPIO_PIN(PORT_C,5)

int adc2_sample_pin_init(uint16_t channel_num)
{
	switch(channel_num)
	{
		case 0: gpio_init(ADC2_C0, GPIO_IN);break;
		case 1: gpio_init(ADC2_C1, GPIO_IN);break;
		case 2: gpio_init(ADC2_C2, GPIO_IN);break;
		case 3: gpio_init(ADC2_C3, GPIO_IN);break;
		case 4: gpio_init(ADC2_C4, GPIO_IN);break;
		case 5: gpio_init(ADC2_C5, GPIO_IN);break;
		case 6: gpio_init(ADC2_C6, GPIO_IN);break;
		case 7: gpio_init(ADC2_C7, GPIO_IN);break;
		case 8: gpio_init(ADC2_C8, GPIO_IN);break;
		case 9: gpio_init(ADC2_C9, GPIO_IN);break;
		case 10: gpio_init(ADC2_C10, GPIO_IN);break;
		case 11: gpio_init(ADC2_C11, GPIO_IN);break;
		case 12: gpio_init(ADC2_C12, GPIO_IN);break;
		case 13: gpio_init(ADC2_C13, GPIO_IN);break;
		case 14: gpio_init(ADC2_C14, GPIO_IN);break;
		case 15: gpio_init(ADC2_C15, GPIO_IN);break;
		default: return -1;
	}
	return 0;
}


int adc2_sample_pins_init(uint16_t *channel_list,uint16_t channel_count)
{
	int i = 0;
	for (i=0;i<channel_count;i++)
	{
		if(adc2_sample_pin_init(channel_list[i]) < 0)
		{
			return -1;
		}
	}
	return 0;
}



int adc2_sample_init(uint16_t *channel_list,uint16_t channel_count)
{
	if(adc2_sample_pins_init(channel_list,channel_count) < 0)
	{
		return -1;
	}

    STD_ADC_InitTypeDef ADC_InitStructure;
    ADC_DeInit(ADC2);
    periph_clk_en(APB2, RCC_APB2Periph_ADC2);
    RCC_ADCCLKConfig(RCC_PCLK2_Div6); //设置ADC时钟（ADCCLK） 72MHZ/6 = 12MHZ

    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent; //独立模式
    ADC_InitStructure.ADC_ScanConvMode = DISABLE; //DISABLE单次模式(单通道) ENABLE多次模式
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE; //关闭连续模式
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right; //ADC数据右对齐
    ADC_InitStructure.ADC_NbrOfChannel = 1; //规则转换的ADC的通道数目,取值范围为1-16

    ADC_Init(ADC2, &ADC_InitStructure); //初始化ADC2配置

