kex2017/ad7606/stm32_src/RIOT/cpu/stm32f1/periph/stm32f10x_std_periph.c
    ADC_Cmd(ADC2, ENABLE); // enable adc

    ADC_ResetCalibration(ADC2);
    while (ADC_GetResetCalibrationStatus(ADC2) == SET)
        ; //获取ADC重置校准寄存器的状态 等待复位结束
    ADC_StartCalibration(ADC2); //开始指定ADC的校准状态
    while (ADC_GetCalibrationStatus(ADC2) == SET)
        ;

	return 0;
}

uint16_t adc2_sample_by_channel(uint16_t channel)
{
    uint16_t temp = 0;

    ADC_ClearFlag(ADC2, ADC_FLAG_EOC);
    ADC_RegularChannelConfig(ADC2, channel, 1, ADC_SampleTime_55Cycles5);
    ADC_SoftwareStartConvCmd(ADC2, ENABLE);

    while (ADC_GetFlagStatus(ADC2, ADC_FLAG_EOC) == RESET)
        ;
    temp = ADC_GetConversionValue(ADC2);
    return temp;
}


#define ADC3_C0 GPIO_PIN(PORT_A,0)
#define ADC3_C1 GPIO_PIN(PORT_A,1)
#define ADC3_C2 GPIO_PIN(PORT_A,2)
#define ADC3_C3 GPIO_PIN(PORT_A,3)
#define ADC3_C4 GPIO_PIN(PORT_F,6)
#define ADC3_C5 GPIO_PIN(PORT_F,7)
#define ADC3_C6 GPIO_PIN(PORT_F,8)
#define ADC3_C7 GPIO_PIN(PORT_F,9)
#define ADC3_C8 GPIO_PIN(PORT_F,10)

#define ADC3_C10 GPIO_PIN(PORT_C,0)
#define ADC3_C11 GPIO_PIN(PORT_C,1)
#define ADC3_C12 GPIO_PIN(PORT_C,2)
#define ADC3_C13 GPIO_PIN(PORT_C,3)

int adc3_sample_pin_init(uint16_t channel_num)
{
	switch(channel_num)
	{
		case 0: gpio_init(ADC3_C0, GPIO_IN);break;
		case 1: gpio_init(ADC3_C1, GPIO_IN);break;
		case 2: gpio_init(ADC3_C2, GPIO_IN);break;
		case 3: gpio_init(ADC3_C3, GPIO_IN);break;
		case 4: gpio_init(ADC3_C4, GPIO_IN);break;
		case 5: gpio_init(ADC3_C5, GPIO_IN);break;
		case 6: gpio_init(ADC3_C6, GPIO_IN);break;
		case 7: gpio_init(ADC3_C7, GPIO_IN);break;
		case 8: gpio_init(ADC3_C8, GPIO_IN);break;
		case 10: gpio_init(ADC3_C10, GPIO_IN);break;
		case 11: gpio_init(ADC3_C11, GPIO_IN);break;
		case 12: gpio_init(ADC3_C12, GPIO_IN);break;
		case 13: gpio_init(ADC3_C13, GPIO_IN);break;
		default: return -1;
	}
	return 0;
}


int adc3_sample_pins_init(uint16_t *channel_list,uint16_t channel_count)
{
	int i = 0;
	for (i=0;i<channel_count;i++)
	{
		if(adc3_sample_pin_init(channel_list[i]) < 0)
		{
			return -1;
		}
	}
	return 0;
}



int adc3_sample_init(uint16_t *channel_list,uint16_t channel_count)
{
	if(adc3_sample_pins_init(channel_list,channel_count) < 0)
	{
		return -1;
	}

    STD_ADC_InitTypeDef ADC_InitStructure;
    ADC_DeInit(ADC3);
    periph_clk_en(APB2, RCC_APB2Periph_ADC3);
    RCC_ADCCLKConfig(RCC_PCLK2_Div6); //设置ADC时钟（ADCCLK） 72MHZ/6 = 12MHZ

    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent; //独立模式
    ADC_InitStructure.ADC_ScanConvMode = DISABLE; //DISABLE单次模式(单通道) ENABLE多次模式
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE; //关闭连续模式
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right; //ADC数据右对齐
    ADC_InitStructure.ADC_NbrOfChannel = 1; //规则转换的ADC的通道数目,取值范围为1-16

    ADC_Init(ADC3, &ADC_InitStructure); //初始化ADC2配置

    ADC_Cmd(ADC3, ENABLE);

    ADC_ResetCalibration(ADC3);
    while (ADC_GetResetCalibrationStatus(ADC3) == SET)
        ; //获取ADC重置校准寄存器的状态 等待复位结束
    ADC_StartCalibration(ADC3); //开始指定ADC的校准状态
    while (ADC_GetCalibrationStatus(ADC3) == SET)
        ;

	return 0;
}

uint16_t adc3_sample_by_channel(uint16_t channel)
{
    uint16_t temp = 0;

    ADC_ClearFlag(ADC3, ADC_FLAG_EOC);
    ADC_RegularChannelConfig(ADC3, channel, 1, ADC_SampleTime_55Cycles5);
    ADC_SoftwareStartConvCmd(ADC3, ENABLE);

    while (ADC_GetFlagStatus(ADC3, ADC_FLAG_EOC) == RESET)
        ;
    temp = ADC_GetConversionValue(ADC3);
    return temp;
}


#define  DAC_PIN     GPIO_PIN(PORT_A,4)

int dac1_pa4_dma2_tim6_wave_outopt_init(uint32_t wave_fre)
{
	gpio_init(DAC_PIN, GPIO_OUT);

    STD_TIM_TimeBaseInitTypeDef    TIM_TimeBaseStructure;
    periph_clk_en(APB1, RCC_APB1Periph_TIM6);

    TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
    TIM_TimeBaseStructure.TIM_Prescaler = 0x0;
    TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;
    TIM_TimeBaseStructure.TIM_Period = wave_fre;
    TIM_TimeBaseInit(STD_TIM6, &TIM_TimeBaseStructure);
    TIM_SelectOutputTrigger(STD_TIM6, TIM_TRGOSource_Update);

    STD_DAC_InitTypeDef            DAC_InitStructure;
    periph_clk_en(APB1, RCC_APB1Periph_DAC);

    DAC_StructInit(&DAC_InitStructure);
    DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;
    DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Disable;
    DAC_InitStructure.DAC_Trigger = DAC_Trigger_T6_TRGO;
    DAC_Init(DAC_Channel_1, &DAC_InitStructure);
    DAC_Cmd(DAC_Channel_1, ENABLE);
    DAC_DMACmd(DAC_Channel_1, ENABLE);
    return 0;
}
void dac1_pa4_dma2_tim6_wave_outopt(uint32_t wave_start_addr,uint16_t wave_len)
{
    STD_DMA_InitTypeDef            DMA_InitStructure;
    periph_clk_en(AHB, RCC_AHBPeriph_DMA2);

    DMA_StructInit( &DMA_InitStructure);
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;//peripherals  to memory
    DMA_InitStructure.DMA_BufferSize = wave_len;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&(DAC->DHR8R1);
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)wave_start_addr;

    DMA_Cmd(DMA2_Channel3, DISABLE);
    DMA_Init(DMA2_Channel3, &DMA_InitStructure);
    DMA_Cmd(DMA2_Channel3, ENABLE);

    TIM_Cmd(STD_TIM6, ENABLE);
}


void iwdg_init(void)
{
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
	// 设置预分频器值
	IWDG_SetPrescaler( IWDG_Prescaler_256 );

	// 设置重装载寄存器值
	IWDG_SetReload( 0xFFF );

	// 把重装载寄存器的值放到计数器中
	IWDG_ReloadCounter();

	// 使能 IWDG
	IWDG_Enable();
}

void iwdg_feed(void)
{
	 IWDG_ReloadCounter();
}


void disable_jtag_pins(void)
{
   periph_clk_en(APB2, RCC_APB2Periph_GPIOB|RCC_APB2Periph_AFIO);
   GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
}














